# 1.Introduction
This assignment will help you to consolidate the concepts learnt in the session.

# 2.Problem Statement

It happens all the time: someone gives you data containing malformed strings, Python, lists and missing data. How do you tidy it up so you can get on with the analysis? Take this monstrosity as the DataFrame to use in the following puzzles: df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'], 'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 'Airline': ['KLM(!)', ' (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

In [92]:
import numpy as np 
import pandas as pd

In [93]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'], 'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 'Airline': ['KLM(!)', ' (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

In [94]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []                 (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

### 1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [95]:
df['FlightNumber']

0    10045.0
1        NaN
2    10065.0
3        NaN
4    10085.0
Name: FlightNumber, dtype: float64

Setting up new index for the data frame. This index is used for the for loop iteration created in next step

In [96]:
newindex = np.arange(1,df.From_To.count()+1)
df.set_index(newindex, inplace=True) 
df

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris       10045.0      [23, 47]               KLM(!)
2      MAdrid_miLAN           NaN            []                 (12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis           NaN          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

 using for loop for iteration along with isnull function to update the values for column FlightNumber

In [97]:
 for i in np.arange(1,df.From_To.count()+1):
        if pd.isnull(df.FlightNumber.loc[i,]):
            df.loc[i,'FlightNumber']= df.FlightNumber.loc[i-1,] + 10

In [98]:
df['FlightNumber'] = df['FlightNumber'].astype(int)

Printing new data frame

In [99]:
df

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris         10045      [23, 47]               KLM(!)
2      MAdrid_miLAN         10055            []                 (12)
3  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis         10075          [13]       12. Air France
5   Brussels_londOn         10085      [67, 32]          "Swiss Air"

### 2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [100]:
  df['From_To']

1        LoNDon_paris
2        MAdrid_miLAN
3    londON_StockhOlm
4      Budapest_PaRis
5     Brussels_londOn
Name: From_To, dtype: object

Creating a new temporary dataframe which is a copy of existing data frame df

In [101]:
temporarydf = df.copy()
temporarydf

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris         10045      [23, 47]               KLM(!)
2      MAdrid_miLAN         10055            []                 (12)
3  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis         10075          [13]       12. Air France
5   Brussels_londOn         10085      [67, 32]          "Swiss Air"

Spliting the column into two based on "_"

In [102]:
temporarydf[['From','To']] = temporarydf.From_To.str.split("_",expand=True)

Printing new data frame

In [103]:
temporarydf

,From_To,FlightNumber,RecentDelays,Airline,From,To
1,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
2,MAdrid_miLAN,10055,[],(12),MAdrid,miLAN
3,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
4,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
5,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

### 3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

Converting the first letter of values in 'From 'column into uppercase

In [104]:
temporarydf.From = temporarydf.From.str.capitalize()

Converting the first letter of values in 'To 'column into uppercase

In [105]:
temporarydf.To = temporarydf.To.str.capitalize()

Converting the first letter of values in 'From_To 'column into uppercase

In [106]:
temporarydf.From_To = temporarydf.From_To.str.capitalize()

In [107]:
temporarydf

,From_To,FlightNumber,RecentDelays,Airline,From,To
1,London_paris,10045,"[23, 47]",KLM(!),London,Paris
2,Madrid_milan,10055,[],(12),Madrid,Milan
3,London_stockholm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
4,Budapest_paris,10075,[13],12. Air France,Budapest,Paris
5,Brussels_london,10085,"[67, 32]","""Swiss Air""",Brussels,London

### 4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

Printing the exisiting df dataframe

In [108]:
df

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris         10045      [23, 47]               KLM(!)
2      MAdrid_miLAN         10055            []                 (12)
3  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis         10075          [13]       12. Air France
5   Brussels_londOn         10085      [67, 32]          "Swiss Air"

Printing the data frame after deleting the "From_To" column

In [109]:
df.drop('From_To',axis=1,inplace=True)
df

   FlightNumber  RecentDelays              Airline
1         10045      [23, 47]               KLM(!)
2         10055            []                 (12)
3         10065  [24, 43, 87]  (British Airways. )
4         10075          [13]       12. Air France
5         10085      [67, 32]          "Swiss Air"

Printing the data frame after adding the "From_To" column from temporarydf

In [110]:
df['From'] = temporarydf['From']
df['To'] = temporarydf['To']
df

   FlightNumber  RecentDelays              Airline      From         To
1         10045      [23, 47]               KLM(!)    London      Paris
2         10055            []                 (12)    Madrid      Milan
3         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
4         10075          [13]       12. Air France  Budapest      Paris
5         10085      [67, 32]          "Swiss Air"  Brussels     London

### 5.In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each
### second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.
### Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

Using the original dataframe provided for this problem.

In [111]:
df1 = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'], 'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 'Airline': ['KLM(!)', ' (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

In [112]:
df1

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []                 (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [113]:
df1.columns

Index(['From_To', 'FlightNumber', 'RecentDelays', 'Airline'], dtype='object')

In [114]:
df1[['Delay1','Delay2','Delay3',]]=pd.DataFrame(df1.RecentDelays.tolist(), index= df1.index)

In [115]:
df1

,From_To,FlightNumber,RecentDelays,Airline,Delay1,Delay2,Delay3
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),23.0,47.0,NaN
1,MAdrid_miLAN,NaN,[],(12),NaN,NaN,NaN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),24.0,43.0,87.0
3,Budapest_PaRis,NaN,[13],12. Air France,13.0,NaN,NaN
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",67.0,32.0,NaN

In [116]:
df1.drop('RecentDelays',axis=1,inplace=True)

In [117]:
# Printing all values in recent delay column in seperate

In [118]:
df1

            From_To  FlightNumber              Airline  Delay1  Delay2  Delay3
0      LoNDon_paris       10045.0               KLM(!)    23.0    47.0     NaN
1      MAdrid_miLAN           NaN                 (12)     NaN     NaN     NaN
2  londON_StockhOlm       10065.0  (British Airways. )    24.0    43.0    87.0
3    Budapest_PaRis           NaN       12. Air France    13.0     NaN     NaN
4   Brussels_londOn       10085.0          "Swiss Air"    67.0    32.0     NaN